/**
 * Урок 3. Некоторые стандартные интерфейсы Java и примеры их использования
 * ============================================================================================
 * Задача: Добавить/Исправить.
 * 
 * Атака, защита - должны быть объявлены в abstract class
 * Выстрелы - только у лучника и арбалетчиков. Стрелы заканчиваются и лучник становиться не боеспособным.
 * Крестьянин - за один ход приносит одну стрелу лучнику.
 * Урон - должно быть две цифры damegeMin и damegeMax.
 * hp - должно быть текущее и maxHp.
 * speed - по нему определяется время очередности персонажа.
 * x, y - добавить координаты.
 * ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 * Сделать два списка (команды) по 10:
 * Первый список - или Крестьянин, или Разбойник, или Снайпер, или Колдун;
 * Второй - или Крестьянин, или Копейщик, или Арбалетчик, или Монах.
 * ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 * Вывести в консоль список персонажей с учетом скорости, чтобы в начале были те у которых 
 * скорость выше внезависимости, от того в каком списки они находятся.
 * 
 */

package OOP_JAVA.seminars.sem_03;

public class Program {
    public static void main(String[] args) {
        
    }
}
